cases/aerodynamicsDrivAer/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -2 0 0 0 0];
internalField       uniform 0;

boundaryField
{
    groupWall
    {
        type        zeroGradient;
    }

    groupSymmetry
    {
        type        symmetry;
    }

    groupDefault
    {
        type        zeroGradient;
    }

    groupTransition
    {
        type        zeroGradient;
    }

    groupSlip
    {
        type        slip;
    }

    groupGRWS_Tire_FL
    {
        type        zeroGradient;
    }

    groupGRWS_Tire_FR
    {
        type        zeroGradient;
    }

    groupGRWS_Tire_RL
    {
        type        zeroGradient;
    }

    groupGRWS_Tire_RR
    {
        type        zeroGradient;
    }

    groupWtunInlet
    {
        type        zeroGradient;
    }

    groupWtunOutlet
    {
        type        fixedValue;
        value       uniform 0;
    }

    groupWtunStreet
    {
        type        zeroGradient;
    }

    // Set patchGroups for constraint types
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
}

// ************************************************************************* //
